# SubQueries

Note: Creating tables by using these datasets
- Employee Dataset:
- Department Dataset:
- Sales Dataset:

In [ ]:
"""
    -- Departments table
    CREATE TABLE departments (
        department_id VARCHAR(5) PRIMARY KEY,
        department_name VARCHAR(50) NOT NULL,
        location VARCHAR(50) NOT NULL
    );

    INSERT INTO departments (department_id, department_name, location) VALUES
    ('D01', 'Sales', 'Mumbai'),
    ('D02', 'Marketing', 'Delhi'),
    ('D03', 'Finance', 'Pune'),
    ('D04', 'HR', 'Bengaluru'),
    ('D05', 'IT', 'Hyderabad');



    -- Employees table
    CREATE TABLE employees (
        emp_id INT PRIMARY KEY,
        name VARCHAR(50) NOT NULL,
        department_id VARCHAR(5),
        salary INT NOT NULL,
        FOREIGN KEY (department_id) REFERENCES departments(department_id)
    );

    INSERT INTO employees (emp_id, name, department_id, salary) VALUES
    (101, 'Abhishek', 'D01', 62000),
    (102, 'Shubham', 'D01', 58000),
    (103, 'Priya', 'D02', 67000),
    (104, 'Rohit', 'D02', 64000),
    (105, 'Neha', 'D03', 72000),
    (106, 'Aman', 'D03', 55000),
    (107, 'Ravi', 'D04', 60000),
    (108, 'Sneha', 'D04', 75000),
    (109, 'Kiran', 'D05', 70000),
    (110, 'Tanuja', 'D05', 65000);




    -- Sales table
    CREATE TABLE sales (
        sale_id INT PRIMARY KEY,
        emp_id INT,
        sale_amount INT NOT NULL,
        sale_date DATE NOT NULL,
        FOREIGN KEY (emp_id) REFERENCES employees(emp_id)
    );

    INSERT INTO sales (sale_id, emp_id, sale_amount, sale_date) VALUES
    (201, 101, 4500, '2025-01-05'),
    (202, 102, 7800, '2025-01-10'),
    (203, 103, 6700, '2025-01-14'),
    (204, 104, 12000, '2025-01-20'),
    (205, 105, 9800, '2025-02-02'),
    (206, 106, 10500, '2025-02-05'),
    (207, 107, 3200, '2025-02-09'),
    (208, 108, 5100, '2025-02-15'),
    (209, 109, 3900, '2025-02-20'),
    (210, 110, 7200, '2025-03-01');

"""

15 Daily Practice Problems (DPP) on Subqueries
### Basic Level

Q1. Retrieve the names of employees who earn more than the average salary of all employees.

In [ ]:
"""
    SELECT name FROM employees
    WHERE salary > (SELECT AVG(salary) FROM employees);
"""

Q2. Find the employees who belong to the department with the highest average salary.

In [ ]:
"""
    SELECT * FROM employees 
    WHERE department_id = (SELECT department_id FROM employees 
                           GROUP BY department_id 
                           ORDER BY AVG(salary) DESC 
                           LIMIT 1
    );
"""

Q3. List all employees who have made at least one sale.

In [ ]:
"""
    SELECT * FROM employees AS e 
    INNER JOIN Sales s ON e.emp_id = s.emp_id;
"""

Q4. Find the employee with the highest sale amount.

In [ ]:
"""
    SELECT e.emp_id, e.name, s.sale_amount 
    FROM employees AS e 
    INNER JOIN Sales s ON e.emp_id = s.emp_id
    WHERE sale_amount = (SELECT MAX(sale_amount) FROM Sales);
"""

Q5. Retrieve the names of employees whose salaries are higher than Shubham’s salary.

In [ ]:
"""
    SELECT name FROM employees
    WHERE salary > (SELECT salary FROM employees WHERE name = 'Shubham');
"""

### Intermediate Level

Q1. Find employees who work in the same department as Abhishek.

In [ ]:
"""
    SELECT * FROM employees
    WHERE department_id = (SELECT department_id FROM employees WHERE name = 'Abhishek');
"""

Q2. List departments that have at least one employee earning more than ₹60,000.

In [ ]:
"""
    SELECT DISTINCT(d.department_name) FROM employees AS e
    INNER JOIN Departments AS d ON e.department_id = d.department_id
    WHERE e.salary > 60000;
"""

Q3. Find the department name of the employee who made the highest sale.

In [ ]:
"""
    SELECT d.department_name FROM employees AS e
    INNER JOIN Departments AS d ON e.department_id = d.department_id
    INNER JOIN Sales AS s ON e.emp_id = s.emp_id
    WHERE s.sale_amount = (SELECT MAX(sale_amount) FROM Sales);
"""

Q4. Retrieve employees who have made sales greater than the average sale amount.

In [ ]:
"""
    SELECT * FROM employees AS e
    INNER JOIN Sales AS s ON e.emp_id = s.emp_id
    WHERE s.sale_amount > (SELECT AVG(sale_amount) FROM sales);
"""

Q5. Find the total sales made by employees who earn more than the average salary.

In [ ]:
"""
    SELECT SUM(s.sale_amount) FROM employees AS e
    INNER JOIN Sales AS s ON e.emp_id = s.emp_id
    WHERE e.salary > (SELECT AVG(salary) FROM employees);
"""

### Advanced Level

Q1. Find employees who have not made any sales.

In [ ]:
"""
    SELECT e.name FROM employees AS e
    LEFT JOIN Sales AS s ON e.emp_id = s.emp_id
    WHERE s.sale_id IS NULL
"""

Q2. List departments where the average salary is above ₹55,000.

In [ ]:
"""
    SELECT DISTINCT(d.department_name), AVG(e.salary) 
    FROM employees AS e
    LEFT JOIN Departments AS d ON e.department_id = d.department_id
    GROUP BY e.department_id
    HAVING AVG(e.salary) > 55000;
"""

Q3. Retrieve department names where the total sales exceed ₹10,000.

In [ ]:
"""
    SELECT DISTINCT(d.department_name), SUM(s.sale_amount) 
    FROM employees AS e
    LEFT JOIN Sales AS s ON e.emp_id = s.emp_id
    LEFT JOIN Departments AS d ON e.department_id = d.department_id
    GROUP BY e.department_id
    HAVING SUM(s.sale_amount) > 10000;
"""

Q4. Find the employee who has made the second-highest sale.

In [ ]:
"""
    SELECT e.name, s.sale_amount
    FROM employees AS e
    LEFT JOIN Sales AS s ON e.emp_id = s.emp_id
    WHERE s.sale_amount = (SELECT MAX(sale_amount) FROM Sales 
                          WHERE sale_amount < (SELECT MAX(sale_amount) FROM Sales)
    );
"""

Q5. Retrieve the names of employees whose salary is greater than the highest sale amount recorded.

In [ ]:
"""
    SELECT e.name, e.salary
    FROM employees AS e
    LEFT JOIN Sales AS s ON e.emp_id = s.emp_id
    WHERE e.salary > (SELECT MAX(sale_amount) FROM Sales);
"""